SaitovSP/src/Documents/ЗакрытиеСмены/ЗакрытиеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСмены</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/СуммаЗаказовКлиенты/СуммаЗаказовКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуммаЗаказовКлиенты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/ЗакрытиеСмены/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Объект.Сумма = СуммаЗаказовЗаДень(Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СуммаЗаказовЗаДень(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот КАК СуммаЗаказаОборот
		|ИЗ
		|	РегистрНакопления.СуммаЗаказовКлиенты.Обороты(&НачалоДня, &КонецДня, День, ) КАК СуммаЗаказовКлиентыОбороты
		|ГДЕ
		|	СуммаЗаказовКлиентыОбороты.Ресторан.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийРесторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаЗаказаОборот;
	КонецЦикла; 
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СуммаЗаДень = СуммаЗаказовЗаДень(Объект.Дата);
	Если СуммаЗаДень = 0 Тогда
		Объект.Сумма = 0;
	Иначе
		Объект.Сумма = СуммаЗаДень;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
КонецПроцедуры
